app/views/patients/edit.html.erb

SELECT  1 AS one FROM "attorneys" WHERE "attorneys"."patient_id" = $1 LIMIT $2  [["patient_id", 6], ["LIMIT", 1]]
SELECT "attorneys".* FROM "attorneys" WHERE "attorneys"."patient_id" = $1  [["patient_id", 6]]
---
      <section class="patient_attorney_info">
        <% if @patient.attorneys.any? %>