app/views/patients/show.html.erb

    <section class="patient_attorney_info">
      <% if @patient.attorneys.any? %>
---
SELECT  1 AS one FROM "attorneys" WHERE "attorneys"."patient_id" = $1 LIMIT $2  [["patient_id", 1], ["LIMIT", 1]]
SELECT "attorneys".* FROM "attorneys" WHERE "attorneys"."patient_id" = $1  [["patient_id", 7]]

    <section class="patient_adjuster_info">
      <% if @patient.adjusters.any? %>
---
SELECT  1 AS one FROM "adjusters" WHERE "adjusters"."patient_id" = $1 LIMIT $2  [["patient_id", "1"], ["LIMIT", 1]]