app/controllers/appointments_controller.rb

  def new
    @patient = Patient.find(params[:patient_id])
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def create
    @patient = Patient.find(params[:patient_id])
    @appointment = @patient.appointments.build(appointment_params)

    respond_to do |format|
      if @appointment.save
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
INSERT INTO "appointments" ("title", "office", "address", "appointment_type", "status", "start_time", "patient_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"