app/controllers/appointments_controller.rb

SELECT  "appointments".* FROM "appointments" LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "appointments"
---
	def index
		@appointment = Appointment.paginate(page: params[:page])