app/controllers/patients_controller.rb

	def index
		if params[:search]
			@patients = Patient.search(params[:search]).paginate(page: params[:page], :per_page => 20)
---
SELECT  "patients".* FROM "patients" WHERE (name LIKE '%Johny%') LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "patients" WHERE (name LIKE '%Johny%')

	def show
		@patient = Patient.find(params[:id])
		@attorneys = @patient.attorneys.paginate(page: params[:page])
		@adjusters = @patient.adjusters.paginate(page: params[:page])
		@appointments = @patient.appointments.paginate(page: params[:page])
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "attorneys".* FROM "attorneys" WHERE "attorneys"."patient_id" = $1 LIMIT $2 OFFSET $3  [["patient_id", 5], ["LIMIT", 30], ["OFFSET", 0]]
SELECT  "adjusters".* FROM "adjusters" WHERE "adjusters"."patient_id" = $1 LIMIT $2 OFFSET $3  [["patient_id", "26"], ["LIMIT", 30], ["OFFSET", 0]]
SELECT  "appointments".* FROM "appointments" WHERE "appointments"."patient_id" = $1 LIMIT $2 OFFSET $3  [["patient_id", 1], ["LIMIT", 30], ["OFFSET", 0]]

	def create
		@patient = Patient.new(patient_params)
			if @patient.save
---
INSERT INTO "patients" ("name", "street_address", "city", "state", "zip_code", "phone", "ssn", "dob", "employer", "claim_number", "panel_number", "wcab_number", "notes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"

	def edit
		@patient = Patient.find(params[:id])
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

	def update
		@patient = Patient.find(params[:id])
		if @patient.update_attributes(patient_params)
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "patients" SET "dob" = $1, "updated_at" = $2 WHERE "patients"."id" = $3  [["dob", "10-15-1987"], ["updated_at", 2016-10-27 02:18:27 UTC], ["id", 4]]

	def destroy
		Patient.find(params[:id]).destroy
---
DELETE FROM "patients" WHERE "patients"."id" = $1  [["id", 1]]
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]