app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "activation_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
  	@user = User.new(user_params)
  		if @user.save